
## Plan Result (ithc)




<pre><code>Plan: 5 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.ccpay-bulkscanning-payment-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
* Update
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription
  * module.cft_api_mgmt_oauth2_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.exela_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-ithc/subscriptions/02f92418-eee1-4957-83ad-64591415a235"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_bulk_scan_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-ithc/subscriptions/0aa12789-acc3-4bca-b5cd-b25d80657924"
        # (10 unchanged attributes hidden)
    }

  # module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "db_monitor_ag-ccpay-bulkscanning-api-postgres-db-v15-ithc"
      + resource_group_name = "ccpay-bulkscanning-api-postgres-db-v15-data-ithc"
      + short_name          = "db_monitor_a"
      + tags                = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-bulkscanning-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "ithc"
          + "managedBy"           = "Fees/Pay"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 1%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_ccpay-bulkscanning-api-postgres-db-v15-ithc"
      + resource_group_name      = "ccpay-bulkscanning-api-postgres-db-v15-data-ithc"
      + scopes                   = [
          + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccpay-bulkscanning-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-bulkscanning-api-postgres-db-v15-ithc",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-bulkscanning-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "ithc"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 1
        }
    }

  # module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 5%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_ccpay-bulkscanning-api-postgres-db-v15-ithc"
      + resource_group_name      = "ccpay-bulkscanning-api-postgres-db-v15-data-ithc"
      + scopes                   = [
          + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccpay-bulkscanning-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-bulkscanning-api-postgres-db-v15-ithc",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-bulkscanning-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "ithc"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 5
        }
    }

  # module.ccpay-bulkscanning-payment-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 0.5%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_ccpay-bulkscanning-api-postgres-db-v15-ithc"
      + resource_group_name      = "ccpay-bulkscanning-api-postgres-db-v15-data-ithc"
      + scopes                   = [
          + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/ccpay-bulkscanning-api-postgres-db-v15-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-bulkscanning-api-postgres-db-v15-ithc",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-bulkscanning-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "ithc"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 0.5
        }
    }

  # module.ccpay-bulkscanning-payment-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "ccpay-bulkscanning-api-postgres-db-v15-data-ithc"
      + server_name         = "ccpay-bulkscanning-api-postgres-db-v15-ithc"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.cft_api_mgmt_oauth2_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-ithc/products/payments-bulk-scanning"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":586,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->